spoemb/linkit-v4-core/ports/nrf52840/main.cpp
#if ENABLE_SEA_TEMP_SENSOR
	DEBUG_TRACE("EZO RTD...");
	try {
		static EZO_RTD_Sensor rtd;
		static SeaTempSensorService rtd_sensor_service(rtd, &rtd_sensor_log);
	} catch (ErrorCode e) {
		DEBUG_TRACE("EZO RTD: not detected [%04X]", e);
	}

	DEBUG_TRACE("TSYS01...");
	try {
		static TSYS01 tsys01;
		static SeaTempSensorService tsys01_sensor_service(tsys01, &tsys01_sensor_log);
	} catch (ErrorCode e) {
		DEBUG_TRACE("TSYS01: not detected [%04X]", e);
	}
#endif

#if ENABLE_AXL_SENSOR
	DEBUG_TRACE("BMA400...");
	try {
		static BMA400 bma400;
		static AXLSensorService axl_sensor_service(bma400, &axl_sensor_log);
	} catch (...) {
		DEBUG_TRACE("BMA400: not detected");
	}
#endif

#if ENABLE_THERMISTOR_SENSOR
	DEBUG_TRACE("Thermistor NTC...");
	try {
		static Thermistor thermistor(THERMISTOR_ADC);
		static ThermistorSensorService thermistor_sensor_service(thermistor, &thermistor_sensor_log);
	} catch (...) {
		DEBUG_TRACE("Thermistor: not detected");
	}
#endif

#ifdef CAM_PWR_EN
	DEBUG_TRACE("RunCam...");
	try {
		static RunCam run_cam;
		static CAMService cam_service(run_cam, &cam_sensor_log);
	} catch (...) {
		DEBUG_TRACE("RunCam: not detected");
	}
#endif

#if ENABLE_MORTALITY_SENSOR
	DEBUG_TRACE("Mortality detection...");
	static MortalityService mortality_svc(&mortality_log);
	mortality_service = &mortality_svc;
#endif

	DEBUG_TRACE("Memory monitor...");
	MemoryMonitorService memory_monitor_service;

	DEBUG_TRACE("Dive mode monitor...");
	DiveModeService dive_mode_service(nrf_reed_switch);

#ifdef EXTERNAL_WAKEUP
	// TPL5111 shutdown timer - powerdown after SHUTDOWN_TIMER seconds
	{
		unsigned int shutdown_timer = configuration_store->read_param<unsigned int>(ParamID::SHUTDOWN_TIMER);
		if (shutdown_timer > 0) {
			DEBUG_INFO("EXTERNAL_WAKEUP: Shutdown timer scheduled for %u seconds", shutdown_timer);
			system_scheduler->post_task_prio([]() {
				DEBUG_INFO("EXTERNAL_WAKEUP: Shutdown timer expired | powering down");
				PMU::powerdown();
			}, "SHUTDOWN_TIMER", Scheduler::DEFAULT_PRIORITY, shutdown_timer * 1000);
		} else {
			DEBUG_INFO("EXTERNAL_WAKEUP: Shutdown timer disabled (SHUTDOWN_TIMER=0)");
		}
	}
#endif

	DEBUG_TRACE("Entering main SM...");

	// This will initialise the FSM
	GenTracker::start();

	// Deep idle: cut peripheral power rails when no task is due soon.
	static constexpr uint64_t DEEP_IDLE_THRESHOLD_MS = 5000;
	static bool in_deep_idle = false;

	// The scheduler should run forever.  Any run-time exceptions should be handled and passed to FSM.
	while (true)
	{
		try {
#ifdef DEBUG_UART_TX_PIN
			if (g_debug_mode != BaseDebugMode::UART)
#endif
				NrfUSB::process();

			// Exit deep idle BEFORE running scheduler tasks — peripherals
			// need power rail restored before any SPI/I2C/UART access.
			if (in_deep_idle) {
				uint64_t remaining = system_scheduler->ms_until_next_task();
				if (remaining <= DEEP_IDLE_THRESHOLD_MS) {
					PMU::exit_deep_idle();
					in_deep_idle = false;
					DEBUG_TRACE("DEEP_IDLE: exit (%llu ms remaining)", remaining);
				}
			}

			// Process timer callbacks deferred from ISR context
			NrfTimer::process_pending();

			system_scheduler->run();

			// Enter deep idle when no tasks are due for a while
			uint64_t idle_ms = system_scheduler->ms_until_next_task();
			if (idle_ms > DEEP_IDLE_THRESHOLD_MS && !in_deep_idle) {
				DEBUG_TRACE("DEEP_IDLE: enter (%llu ms idle)", idle_ms);
				in_deep_idle = true;
				PMU::enter_deep_idle();
			}

			// Safety watchdog kick — reduces dependency on scheduled task
			PMU::kick_watchdog();

			PMU::run();
		} catch (ErrorCode e) {
			ErrorEvent event;
			event.error_code = e;
			GenTracker::dispatch(event);
		}
	}
}
